pref_H = {'A':'1.45','C':'0.77','D':'0.98','E':'1.53','F':'1.12','G':'0.53','H':'1.24','I':'1.00','K':'1.07','L':'1.34'\
,'M':'1.20','N':'0.73','P':'0.59','Q':'1.17','R':'0.79','S':'0.79','T':'0.82','V':'1.14','W':'1.14','Y':'0.61'}
pref_E = {'A':'0.97','C':'1.30','D':'0.80','E':'0.26','F':'1.28','G':'0.81','H':'0.71','I':'1.60','K':'0.74','L':'1.22'\
,'M':'1.67','N':'0.65','P':'0.62','Q':'1.23','R':'0.90','S':'0.72','T':'1.20','V':'1.65','W':'1.19','Y':'1.29'}
a = input("请输入要预测的序列：")
list = []
for i in a:
    if i not in pref_H and pref_E:
        continue
    elif eval(pref_H[i]) >= 1 and eval(pref_E[i]) < eval(pref_H[i]): #eval()函数用来执行一个字符串表达式，并返回表达式的值。
        i = 'H'
    elif eval(pref_E[i]) >= 1 and eval(pref_H[i]) < eval(pref_E[i]):
        i = 'E'
    else:
        i = 'L'
    list.append(i)
print(list)